Tekla Open API Reference for Tekla Structures 2025
LoadLine.LineLoadFormEnum Enumeration
 The line load form.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LineLoadFormEnum
Public Enumeration LineLoadFormEnum
Members
Member name | Value | Description
LOAD_FORM_LINE_1 | 1001 |  The load magnitude is uniform across the loaded length.
LOAD_FORM_LINE_2 | 1002 |  The load has different magnitudes at the ends of the loaded length. The magnitude changes linearly between the ends.
LOAD_FORM_LINE_3 | 1003 |  The load magnitude changes linearly, from zero at the ends of the loaded length, to a fixed value in the middle of the loaded length.
LOAD_FORM_LINE_4 | 1004 |  The load magnitude changes linearly, from zero at one end of the loaded length, through two (different) values, back to zero at the other end.
See Also
Reference
Tekla.Structures.Model Namespace